# ***** комментарии *****

# Ctrl + / - открытие однострочного комментария

""" qwerty 
многострочный
комментарий
qwerty """

# a = 10
# b = 20



# ***** встроенные функции ввода и вывода *****

# вызов функции печати в терминал (print)
# print("Привет, 'мир'")

# PEP8

# вызов функции ввода из терминала (input)
# print(input("введите что-то:"))

# ***** Переменные *****

my_var = 100
myVar = 200

# операция сложения
r = my_var + myVar

# print(r)




# ***** типы данных******

int_num = 1000 # 

float_num = 3.14 #  числа с плавающей точкой (вещественные)

my_str = "Привет, мир" # строки (строковые значения)

boolean = True # false -  булевы значения (bool)



# print(int_num * 2)


# print(int_num * floatNum)


result = my_str * 3

result_1 = my_str * 3 # умножение строк

result_2 = my_str + ' ' + "python" # конкатенация

# print(result_1, result_2)

#  ***** Способ форматирования строк f-string*****

name = "John"
age = 25

s = f"My nsme is {name}. Age: {age}."

# print(s)


# ***** Арифметические операции *****

x= 10
y = 5.2

res_1 = x + y

res_2 = x * y

res_3 = x / y # обычное деление

res_4 = x // y # целочисленное деление

res_5 = x % y # деление по остатку

res_6 = x ** y

import math # импоортирование модуля

res_7 = math.sqrt(100)

# print(res_7)


# ***** Логические опреации*****

x = 2
y = 5

res_1 = x != y # оператор "не равно" (not)

res_2 = x == y # оператор "равно"

res_3 = x > y # оператор "больше"
 
res_4 = x < y # оператор "меньше"

res_5 = x >= y # оператор "больше или равно"

res_6 = x <= y # оператор "меньше или равно"

print(res_6)







